tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'ack'
brew 'act'
brew 'adwaita-icon-theme'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'asciidoctor'
brew 'asdf'
brew 'aspcud'
brew 'aspell'
brew 'assimp'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bat'
brew 'bdw-gc'
brew 'brew-cask-completion'
brew 'brotli'
brew 'btop'
brew 'ca-certificates'
brew 'cabal-install'
brew 'cabextract'
brew 'cairo'
brew 'cjson'
brew 'clingo'
brew 'cmake'
brew 'cmake-docs'
brew 'cmocka'
brew 'coretemp'
brew 'coreutils'
brew 'curl'
brew 'dav1d'
brew 'dbt-postgres'
brew 'dbus'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'docker-credential-helper'
brew 'double-conversion'
brew 'duck'
brew 'eksctl'
brew 'elixir'
brew 'elixir-ls'
brew 'emacs-plus@28'
brew 'erlang'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'flac'
brew 'fluxcd/tap/flux'
brew 'fontconfig'
brew 'fop'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghc'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'git-flow'
brew 'git-lfs'
brew 'gitmoji'
brew 'gitui'
brew 'glfw'
brew 'glib'
brew 'grip'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'go-md2man'
brew 'gobject-introspection'
brew 'gpatch'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'grpcurl'
brew 'gsasl'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'hcloud'
brew 'helm'
brew 'hicolor-icon-theme'
brew 'httpie'
brew 'hunspell'
brew 'hyperkit'
brew 'icu4c'
brew 'imagemagick'
brew 'imath'
brew 'intltool'
brew 'irssi'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg'
brew 'jpeg-xl'
brew 'jq'
brew 'k9s'
brew 'kafka'
brew 'krb5'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lame'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcerf'
brew 'libde265'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgccjit'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libheif'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblqr'
brew 'libmng'
brew 'libmodplug'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'libpthread-stubs'
brew 'libqalculate'
brew 'libraw'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'lua@5.1'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mailutils'
brew 'make'
brew 'mas'
brew 'mbedtls'
brew 'md4c'
brew 'media-info'
brew 'meson'
brew 'minikube'
brew 'molten-vk'
brew 'mono'
brew 'mosh'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'ncurses'
brew 'neofetch'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'ninja'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'nushell'
brew 'ocaml'
brew 'oniguruma'
brew 'opam'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pandoc'
brew 'pango'
brew 'parallel'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pgcli'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'popt'
brew 'postgresql'
brew 'protobuf'
brew 'python-tabulate'
brew 'python-yq'
brew 'python'
brew 'python@3.10'
brew 'qalculate-gtk'
brew 'qt'
brew 'qt@5'
brew 'rabbitmq'
brew 'rav1e'
brew 'rclone'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'rust'
brew 'saulpw/vd/visidata'
brew 'screenresolution'
brew 'sdl2'
brew 'sdl2_image'
brew 'sdl2_mixer'
brew 'sdl2_ttf'
brew 'sentry-cli'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'six'
brew 'sleepwatcher'
brew 'snappy'
brew 'speedtest-cli'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'subversion'
brew 'swig'
brew 'tesseract'
brew 'texinfo'
brew 'theora'
brew 'tmux'
brew 'tmuxp'
brew 'topgrade'
brew 'unbound'
brew 'unixodbc'
brew 'unzip'
brew 'utf8proc'
brew 'watch'
brew 'webp'
brew 'websocat'
brew 'wget'
brew 'winetricks'
brew 'wxwidgets'
brew 'wxwidgets', link: false
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'ykman'
brew 'yt-dlp'
brew 'zenity'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zookeeper'
brew 'zsh'
brew 'zstd'

cask '1password-cli'
cask 'adobe-digital-editions'
cask 'android-platform-tools'
cask 'anki'
cask 'bartender'
cask 'biglybt'
cask 'brave-browser'
cask 'calibre'
cask 'chromedriver'
cask 'crossover'
cask 'cyberduck'
cask 'dash'
cask 'deepl'
cask 'discord'
cask 'elmedia-player'
cask 'finicky'
cask 'firefox-developer-edition'
cask 'folx'
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'gimp'
cask 'google-chrome'
cask 'iina'
cask 'insomnia'
cask 'intel-power-gadget'
cask 'istat-menus'
cask 'iterm2'
cask 'keka'
cask 'kekaexternalhelper'
cask 'logitech-g-hub'
cask 'logitech-options'
cask 'meetingbar'
cask 'mos'
cask 'nordvpn'
cask 'obinskit'
cask 'omnidisksweeper'
cask 'raindropio'
cask 'raycast'
cask 'swiftbar'
cask 'vagrant'
cask 'visual-studio-code'
cask 'visualvm'
cask 'vlc'
cask 'xquartz'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'

mas '1Blocker', id: 1_365_531_024
mas 'Amphetamine', id: 937_984_704
mas 'Cardhop', id: 1_290_358_394
mas 'GarageBand', id: 682_658_836
mas 'Keynote', id: 409_183_694
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Raivo OTP', id: 1_498_497_896
mas 'Save to Raindrop.io', id: 1_549_370_672
mas 'Shareful', id: 1_522_267_256
mas 'Slack', id: 803_453_959
mas 'Sorted', id: 1_306_893_526
mas 'Speediness', id: 1_596_706_466
mas 'Speedtest', id: 1_153_157_709
mas 'SponsorBlock for YouTube - Skip Sponsorships', id: 1_573_461_917
mas 'Super Agent', id: 1_568_262_835
mas 'Tampermonkey', id: 1_482_490_089
mas 'Telegram', id: 747_648_890
mas 'URL Linker', id: 1_289_119_450
mas 'Vimari', id: 1_480_933_944
mas 'WhatsApp', id: 1_147_396_723
mas 'Xcode', id: 497_799_835
mas 'com.adriangranados.wifiexplorerlite', id: 1_408_727_408
mas 'monday.com', id: 1_298_450_641
mas 'uBlacklist for Safari', id: 1_547_912_640
mas 'xSearch', id: 1_579_902_068
