tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'paul-nameless/homebrew-repo'
tap 'vectordotdev/brew'

brew 'ack'
brew 'act'
brew 'asciidoctor'
brew 'asdf'
brew 'aspcud'
brew 'aspell'
brew 'awscli'
brew 'bandcamp-dl'
brew 'bash'
brew 'bat'
brew 'brew-cask-completion'
brew 'btop'
brew 'cabal-install'
brew 'cataclysm'
brew 'clojure'
brew 'clojure-lsp'
brew 'cmake'
brew 'cmake'
brew 'cmake-docs'
brew 'colima'
brew 'cpanminus'
brew 'curl'
brew 'd12frosted/emacs-plus/emacs-plus@28'
brew 'dbt-labs/dbt/dbt-postgres'
brew 'direnv'
brew 'docker'
brew 'docker-credential-helper'
brew 'dos2unix'
brew 'duck'
brew 'eksctl'
brew 'elixir-ls'
brew 'erlang@23'
brew 'exa'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'fluxcd/tap/flux'
brew 'fop'
brew 'fzf'
brew 'gawk'
brew 'getsentry/tools/sentry-cli'
brew 'gh'
brew 'git'
brew 'git-crypt'
brew 'git-flow'
brew 'git-lfs'
brew 'gitmoji'
brew 'gitui'
brew 'glfw'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'go-md2man'
brew 'gperf'
brew 'graphviz'
brew 'grep'
brew 'grip'
brew 'grpcurl'
brew 'hacker1024/hacker1024/coretemp'
brew 'hcloud'
brew 'helm'
brew 'httpie'
brew 'hyperkit'
brew 'ical-buddy'
brew 'inetutils'
brew 'intltool'
brew 'irssi'
brew 'jesseduffield/lazygit/lazygit'
brew 'k9s'
brew 'kafka'
brew 'kubectx'
brew 'libiconv'
brew 'llvm'
brew 'lua@5.1'
brew 'luajit-openresty'
brew 'make'
brew 'mas'
brew 'media-info'
brew 'meson'
brew 'minikube'
brew 'molten-vk'
brew 'mono'
brew 'mosh'
brew 'mpv'
brew 'neofetch'
brew 'neomutt'
brew 'neovim'
brew 'nmap'
brew 'nnn'
brew 'nushell'
brew 'ocaml'
brew 'opam'
brew 'openjdk@11'
brew 'openssl'
brew 'pandoc'
brew 'parallel'
brew 'perl'
brew 'pgcli'
brew 'pinentry-mac'
brew 'poppler'
brew 'postgresql@14'
brew 'python-tabulate'
brew 'python-yq'
brew 'pv'
brew 'qalculate-gtk'
brew 'qt'
brew 'rabbitmq'
brew 'rclone'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep-all'
brew 'rsync'
brew 'ruby'
brew 'rust'
brew 'saulpw/vd/visidata'
brew 'shellcheck'
brew 'shfmt'
brew 'sleepwatcher'
brew 'speedtest-cli'
brew 'starship'
brew 'subversion'
brew 'swig'
brew 'tdlib'
brew 'terminal-notifier'
brew 'texinfo'
brew 'tg'
brew 'tmuxp'
brew 'topgrade'
brew 'urlview'
brew 'vector'
brew 'w3m'
brew 'watch'
brew 'websocat'
brew 'wget'
brew 'winetricks'
brew 'wxwidgets'
brew 'ykman'
brew 'yt-dlp'
brew 'zenity'
brew 'zsh'

cask '1password-cli'
cask 'adobe-digital-editions'
cask 'android-platform-tools'
cask 'anki'
cask 'bartender'
cask 'biglybt'
cask 'brave-browser'
cask 'calibre'
cask 'chromedriver'
cask 'crossover'
cask 'cyberduck'
cask 'darktable'
cask 'dash'
cask 'deepl'
cask 'discord'
cask 'element'
cask 'fantastical'
cask 'fig'
cask 'finicky'
cask 'firefox-developer-edition'
cask 'flash-player'
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'gimp'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iina'
cask 'intel-power-gadget'
cask 'ipfs'
cask 'iterm2'
cask 'keka'
cask 'logitech-options'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'miro'
cask 'moonlight'
cask 'mos'
cask 'mountain-duck'
cask 'multimc'
cask 'obinskit'
cask 'omnidisksweeper'
cask 'parsec'
cask 'raindropio'
cask 'raycast'
cask 'signal'
cask 'swiftbar'
cask 'tor-browser'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'wwdc'
cask 'xquartz'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'

mas '1Blocker', id: 1_365_531_024
mas 'Amphetamine', id: 937_984_704
mas 'Cardhop', id: 1_290_358_394
mas 'GarageBand', id: 682_658_836
mas 'Keynote', id: 409_183_694
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Raivo OTP', id: 1_498_497_896
mas 'Save to Raindrop.io', id: 1_549_370_672
mas 'Shareful', id: 1_522_267_256
mas 'Slack', id: 803_453_959
mas 'Sorted', id: 1_306_893_526
mas 'Speediness', id: 1_596_706_466
mas 'Speedtest', id: 1_153_157_709
mas 'SponsorBlock for YouTube - Skip Sponsorships', id: 1_573_461_917
mas 'Super Agent', id: 1_568_262_835
mas 'Tampermonkey', id: 1_482_490_089
mas 'Telegram', id: 747_648_890
mas 'URL Linker', id: 1_289_119_450
mas 'Vimari', id: 1_480_933_944
mas 'WhatsApp', id: 1_147_396_723
mas 'Xcode', id: 497_799_835
mas 'com.adriangranados.wifiexplorerlite', id: 1_408_727_408
mas 'monday.com', id: 1_298_450_641
mas 'uBlacklist for Safari', id: 1_547_912_640
mas 'xSearch', id: 1_579_902_068
