# frozen_string_literal: true

#==> Taps
tap 'd12frosted/emacs-plus'
tap 'dbt-labs/dbt'
tap 'derailed/k9s'
tap 'fluxcd/tap'
tap 'gcenx/wine'
tap 'getsentry/tools'
tap 'hacker1024/hacker1024'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'jesseduffield/lazygit'
tap 'paul-nameless/repo'
tap 'railwaycat/emacsmacport'
tap 'saulpw/vd'
tap 'smudge/smudge'
tap 'teamookla/speedtest'
tap 'vectordotdev/brew'

#==> Formulae
brew 'ack'
brew 'act'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'pcre2'
brew 'glib'
brew 'pkg-config'
brew 'libpthread-stubs'
brew 'xorgproto'
brew 'libxau'
brew 'libxdmcp'
brew 'libxcb'
brew 'libx11'
brew 'libxext'
brew 'libxrender'
brew 'lzo'
brew 'pixman'
brew 'cairo'
brew 'fribidi'
brew 'jpeg-turbo'
brew 'libtiff'
brew 'gdk-pixbuf'
brew 'graphite2'
brew 'icu4c'
brew 'harfbuzz'
brew 'lz4'
brew 'pango'
brew 'xz'
brew 'zstd'
brew 'librsvg'
brew 'adwaita-icon-theme'
brew 'brotli'
brew 'giflib'
brew 'highway'
brew 'imath'
brew 'openexr'
brew 'webp'
brew 'jpeg-xl'
brew 'libvmaf'
brew 'aom'
brew 'apr'
brew 'ca-certificates'
brew 'openssl@1.1'
brew 'apr-util'
brew 'asciidoctor'
brew 'lua'
brew 'mpdecimal'
brew 'readline'
brew 'sqlite'
brew 'clingo'
brew 'gdbm'
brew 'python@3.10'
brew 'aspcud'
brew 'aspell'
brew 'assimp'
brew 'atk'
brew 'm4'
brew 'autoconf'
brew 'autoconf-archive'
brew 'automake'
brew 'awk'
brew 'aws-iam-authenticator'
brew 'six'
brew 'awscli'
brew 'b2-tools'
brew 'bandcamp-dl'
brew 'bash'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db', link: true
brew 'brew-cask-completion'
brew 'gmp'
brew 'isl'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'btop'
brew 'c-ares'
brew 'ghc'
brew 'cabal-install'
brew 'cabextract'
brew 'capstone'
brew 'libogg'
brew 'flac'
brew 'libmodplug'
brew 'libvorbis'
brew 'mpg123'
brew 'sdl2'
brew 'libavif'
brew 'sdl2_image'
brew 'sdl2_mixer'
brew 'sdl2_ttf'
brew 'cataclysm'
brew 'cjson'
brew 'little-cms2'
brew 'openjdk'
brew 'rlwrap'
brew 'clojure'
brew 'openjdk@11'
brew 'clojure-lsp'
brew 'cmake'
brew 'cmake-docs'
brew 'cmocka'
brew 'libtool'
brew 'libunistring'
brew 'guile'
brew 'libevent'
brew 'libidn2'
brew 'libnghttp2'
brew 'libtasn1'
brew 'nettle'
brew 'p11-kit'
brew 'unbound'
brew 'gnutls'
brew 'libslirp'
brew 'libssh'
brew 'libusb'
brew 'ncurses'
brew 'snappy'
brew 'vde'
brew 'qemu'
brew 'lima'
brew 'colima'
brew 'coreutils'
brew 'cpanminus'
brew 'libssh2'
brew 'openldap'
brew 'rtmpdump'
brew 'curl'
brew 'dav1d'
brew 'dbus'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'docker-credential-helper'
brew 'dos2unix'
brew 'double-conversion'
brew 'duck'
brew 'eksctl'
brew 'unixodbc'
brew 'wxwidgets'
brew 'erlang@23'
brew 'exa'
brew 'exiftool'
brew 'fd'
brew 'frei0r'
brew 'lame'
brew 'openjpeg'
brew 'leptonica'
brew 'libb2'
brew 'libarchive'
brew 'libass'
brew 'libbluray'
brew 'mbedtls'
brew 'librist'
brew 'opus'
brew 'libsndfile'
brew 'libsamplerate'
brew 'libsodium'
brew 'libsoxr'
brew 'libvidstab'
brew 'libvpx'
brew 'opencore-amr'
brew 'rav1e'
brew 'rubberband'
brew 'speex'
brew 'srt'
brew 'tesseract'
brew 'theora'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'zeromq'
brew 'zimg'
brew 'ffmpeg'
brew 'ffmpeg@4'
brew 'findutils'
brew 'fish'
brew 'fop'
brew 'fzf'
brew 'gawk'
brew 'gd'
brew 'gh'
brew 'jbig2dec'
brew 'libidn'
brew 'ghostscript'
brew 'git'
brew 'git-crypt'
brew 'git-delta'
brew 'git-flow'
brew 'git-lfs'
brew 'libuv'
brew 'node'
brew 'gitmoji'
brew 'gitui'
brew 'glfw'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'npth'
brew 'pinentry'
brew 'gnupg'
brew 'gpgme'
brew 'gmime'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'libcerf'
brew 'qt@5'
brew 'gnuplot'
brew 'go'
brew 'go-md2man'
brew 'gobject-introspection'
brew 'gpatch'
brew 'gperf'
brew 'jasper'
brew 'netpbm'
brew 'gts'
brew 'graphviz'
brew 'grep'
brew 'grip'
brew 'psutils'
brew 'uchardet'
brew 'groff'
brew 'grpcurl'
brew 'gsasl'
brew 'gsettings-desktop-schemas'
brew 'hicolor-icon-theme'
brew 'libepoxy'
brew 'gtk+3'
brew 'hcloud'
brew 'helm'
brew 'httpie'
brew 'hunspell'
brew 'libev'
brew 'hyperkit'
brew 'ical-buddy'
brew 'libde265'
brew 'xmlto'
brew 'shared-mime-info'
brew 'libheif'
brew 'liblqr'
brew 'libomp', link: true
brew 'libraw'
brew 'imagemagick'
brew 'inetutils'
brew 'intltool'
brew 'irssi'
brew 'jansson'
brew 'jc'
brew 'jpeg'
brew 'oniguruma'
brew 'jq'
brew 'k9s'
brew 'zookeeper'
brew 'kafka'
brew 'krb5'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'libffi'
brew 'libgccjit'
brew 'libiconv'
brew 'liblinear'
brew 'libmng'
brew 'libmtp'
brew 'libpq'
brew 'libqalculate'
brew 'unibilium'
brew 'libtermkey'
brew 'libvterm'
brew 'libyaml'
brew 'z3'
brew 'llvm'
brew 'lmdb'
brew 'lua@5.1'
brew 'lua@5.3'
brew 'luajit'
brew 'luajit-openresty'
brew 'luv'
brew 'mailutils'
brew 'make'
brew 'mas'
brew 'md4c'
brew 'media-info'
brew 'ninja'
brew 'meson'
brew 'minikube'
brew 'molten-vk'
brew 'mono'
brew 'protobuf'
brew 'mosh'
brew 'mujs'
brew 'vapoursynth'
brew 'yt-dlp'
brew 'mpv'
brew 'msgpack'
brew 'screenresolution'
brew 'neofetch'
brew 'talloc'
brew 'xapian'
brew 'notmuch'
brew 'tokyo-cabinet'
brew 'neomutt'
brew 'tree-sitter'
brew 'neovim'
brew 'pcre'
brew 'nmap'
brew 'nnn'
brew 'nspr'
brew 'nss'
brew 'openssl@3'
brew 'nushell'
brew 'ocaml'
brew 'opam'
brew 'p7zip'
brew 'pandoc'
brew 'parallel'
brew 'perl'
brew 'python-tabulate'
brew 'pgcli'
brew 'pinentry-mac'
brew 'poppler'
brew 'popt'
brew 'postgresql@14', restart_service: true
brew 'pv'
brew 'py3cairo'
brew 'pygobject3'
brew 'pyyaml'
brew 'python-yq'
brew 'python@3.9'
brew 'qalculate-gtk'
brew 'qt'
brew 'rabbitmq', restart_service: true
brew 'rclone'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'ripgrep'
brew 'ripgrep-all'
brew 'xxhash'
brew 'rsync'
brew 'ruby'
brew 'rust'
brew 'shellcheck'
brew 'shfmt'
brew 'sleepwatcher'
brew 'speedtest-cli'
brew 'starship'
brew 'utf8proc'
brew 'subversion'
brew 'swig'
brew 'tdlib'
brew 'terminal-notifier'
brew 'texinfo'
brew 'tmux'
brew 'tmuxp'
brew 'topgrade'
brew 'trash'
brew 'unzip'
brew 'urlview'
brew 'w3m'
brew 'watch'
brew 'websocat'
brew 'wget'
brew 'winetricks'
brew 'ykman'
brew 'zenity'
brew 'zlib'
brew 'zsh'
brew 'd12frosted/emacs-plus/emacs-plus@28',
     args: %w[with-dbus with-imagemagick with-mailutils with-native-comp with-nobu417-big-sur-icon
              with-xwidgets]
brew 'dbt-labs/dbt/dbt-postgres'
brew 'fluxcd/tap/flux'
brew 'getsentry/tools/sentry-cli'
brew 'hacker1024/hacker1024/coretemp'
brew 'jesseduffield/lazygit/lazygit'
brew 'paul-nameless/repo/tg'
brew 'saulpw/vd/visidata'
brew 'smudge/smudge/nightlight'
brew 'vectordotdev/brew/vector'

#==> Casks
cask '1password-cli'
cask 'adobe-digital-editions'
cask 'airparrot'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'aws-vault'
cask 'bartender'
cask 'biglybt'
cask 'brave-browser'
cask 'calibre'
cask 'chromedriver'
cask 'crossover'
cask 'cyberduck'
cask 'dash'
cask 'discord'
cask 'element'
cask 'finicky'
cask 'firefox-developer-edition'
cask 'flash-player'
cask 'font-fira-code-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'google-chrome'
cask 'hammerspoon'
cask 'ipfs'
cask 'iterm2'
cask 'keka'
cask 'logitech-options'
cask 'macfuse'
cask 'messenger'
cask 'microsoft-teams'
cask 'moonlight'
cask 'mos'
cask 'nordvpn'
cask 'obinskit'
cask 'omnidisksweeper'
cask 'parsec'
cask 'raycast'
cask 'setapp'
cask 'signal'
cask 'swiftbar'
cask 'thunderbird-beta'
cask 'tor-browser'
cask 'universal-android-debloater'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'
cask 'zerotier-one'

#==> App Store Apps
mas '1Blocker', id: 1_365_531_024
mas '1Password for Safari', id: 1_569_813_296
mas 'Amphetamine', id: 937_984_704
mas 'Baking Soda', id: 1_601_151_613
mas 'Cardhop', id: 1_290_358_394
mas 'Dark Reader for Safari', id: 1_438_243_180
mas 'Developer', id: 640_199_958
mas 'Exporter', id: 1_099_120_373
mas 'GarageBand', id: 682_658_836
mas 'Keynote', id: 409_183_694
mas 'Mapper', id: 1_589_391_989
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Privacy Redirect', id: 1_578_144_015
mas 'Raivo OTP', id: 1_498_497_896
mas 'Reeder', id: 1_529_448_980
mas 'Shareful', id: 1_522_267_256
mas 'Slack', id: 803_453_959
mas 'Speediness', id: 1_596_706_466
mas 'SponsorBlock for YouTube - Skip Sponsorships', id: 1_573_461_917
mas 'Steam Link', id: 1_246_969_117
mas 'Super Agent', id: 1_568_262_835
mas 'Tampermonkey', id: 1_482_490_089
mas 'Telegram', id: 747_648_890
mas 'uBlacklist for Safari', id: 1_547_912_640
mas 'URL Linker', id: 1_289_119_450
mas 'Userscripts', id: 1_463_298_887
mas 'Vimari', id: 1_480_933_944
mas 'Vinegar', id: 1_591_303_229
mas 'WhatsApp', id: 1_147_396_723
