jorgebucaran/fisher
patrickf1/fzf.fish
dracula/fish
jethrokuan/z
oh-my-fish/plugin-license
jhillyerd/plugin-git
gazorby/fish-abbreviation-tips
gazorby/fish-exa
halostatue/fish-utils-core@v2.x
